[
    {
        "url": "https://www.instagram.com/umbclife/p/DOWYSRek6s5/",
        "timestamp": "2025-09-16 10:41:08",
        "post_date": "2025-09-08T17:29:45.000Z",
        "caption": "We are ready to tackle our first full week of the fall semester! Extra credit (in the form of a True Grit high five) to any new students who can find themselves in the class photo!",
        "hashtags": [],
        "likes": "1101",
        "comments_count": "1",
        "media_urls": []
    },
    {
        "url": "https://www.instagram.com/umbclife/p/DOJAF3VDRJe/",
        "timestamp": "2025-09-16 10:41:13",
        "post_date": "2025-09-03T12:48:12.000Z",
        "caption": "Cristian Mena and William McConnell, both seniors studying mechanical engineering, and Emily DiMarzio, a junior studying environmental science and geography, were all selected to join The Key Bridge Rebuild Internship Program this summer. The Key Bridge internship program launched this year as a partnership between the @themdta and @mdmhec. Link in bio to read more!",
        "hashtags": [],
        "likes": "235",
        "comments_count": "2",
        "media_urls": []
    },
    {
        "url": "https://www.instagram.com/umbclife/p/DN3RxjAWGPu/",
        "timestamp": "2025-09-16 10:41:18",
        "post_date": "2025-08-27T15:36:22.000Z",
        "caption": "Happy first day of classes, Retrievers! What did we learn at Convocation yesterday? Ask questions! If you find yourself unsure of where your next class is (or just want to grab some swag), there are info tents around campus to answer all your questions. We're looking forward to making this our best year yet!",
        "hashtags": [],
        "likes": "378",
        "comments_count": "0",
        "media_urls": []
    },
    {
        "url": "https://www.instagram.com/umbclife/p/DNyXlIQ2NJH/",
        "timestamp": "2025-09-16 10:41:23",
        "post_date": "2025-08-25T17:50:55.000Z",
        "caption": "\"There's no place like home 💛🖤\nThank you to all of our campus friends who helped move the newest cohort of Retrievers in over the weekend! With upcoming activities like Convocation, Involvement Fest, and more, this semester's fun is just getting started!\"",
        "hashtags": [],
        "likes": "1119",
        "comments_count": "2",
        "media_urls": []
    },
    {
        "url": "https://www.instagram.com/umbclife/p/DOqoVHMkyW0/",
        "timestamp": "2025-09-16 10:41:28",
        "post_date": "2025-09-16T14:14:45.000Z",
        "caption": "\"Dann Malihom ’10, M.A. ’16, has spent most of his adult life at UMBC. He is a double alum (with plans to be a triple alum one day), earning both his degrees in sociology. Now a UMBC staff member—an event specialist in the Office of Institutional Advancement—he is also an adjunct faculty member in the sociology, anthropology, and public health department. And Dann serves as the vice president of engagement on the UMBC Alumni Association Board of Directors. Talk about a lifelong Retriever! \nRead more at news.umbc.edu.\n\n📸 1. After participating in the Family Fun Run at Homecoming 2024 with his kids, Malihom, left, with a former colleague, Robert Bernhard, and two former student employees.\n📸2. In the often-used campus photo from the 2008 America East championship basketball game that took us to the NCAA tournament for the first time, Malihom can be seen in the front, wearing a yellow bandana.\"",
        "hashtags": [],
        "likes": "39",
        "comments_count": "1",
        "media_urls": []
    }
]